name: "enhancer"
backend: "python"
max_batch_size: 32

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]

dynamic_batching {
  max_queue_delay_microseconds: 1000000000
}


input [
    {
        name: "input",
        data_type: TYPE_FP32,
        dims: [-1],
    }
]
output [
    {
        name: "output",
        data_type: TYPE_FP32,
        dims: [-1],
    }
]
